tow-mater-backend/app/controllers/tows_controller.rb

    def index
        tows = Tow.all
---
SELECT "tows".* FROM "tows"

    def create
        tow = Tow.create(tow_params)
        tow.driver = @driver
        tow.dispatcher = @dispatcher
        tow.save
---
INSERT INTO "tows" ("tow_type", "subtype", "driver_id", "dispatcher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["tow_type", ""], ["subtype", ""], ["driver_id", 9], ["dispatcher_id", 7], ["created_at", "2020-07-19 17:20:28.350544"], ["updated_at", "2020-07-19 17:20:28.350544"]]
INSERT INTO "drivers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "${towDriver.value}"], ["created_at", "2020-07-19 17:36:43.750516"], ["updated_at", "2020-07-19 17:36:43.750516"]]
INSERT INTO "dispatchers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "${towDispatcher.value}"], ["created_at", "2020-07-19 17:36:43.888592"], ["updated_at", "2020-07-19 17:36:43.888592"]]
INSERT INTO "tows" ("subtype", "driver_id", "dispatcher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["subtype", "lock out"], ["driver_id", 1], ["dispatcher_id", 2], ["created_at", "2020-07-19 18:13:53.584811"], ["updated_at", "2020-07-19 18:13:53.584811"]]

    def edit
        tow = Tow.find_by(id: params[:id])
---
SELECT "tows".* FROM "tows" WHERE "tows"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        tow = Tow.find_by(id: params[:id])
        tow.driver = @driver
        tow.dispatcher = @dispatcher
        tow.update(tow_params)
---
SELECT "tows".* FROM "tows" WHERE "tows"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "tows" SET "driver_id" = ?, "dispatcher_id" = ?, "tow_type" = ?, "subtype" = ?, "updated_at" = ? WHERE "tows"."id" = ?  [["driver_id", 4], ["dispatcher_id", 9], ["tow_type", "cash call"], ["subtype", "tire change"], ["updated_at", "2020-07-20 06:06:22.249104"], ["id", 4]]

    def get_driver_and_dispatcher
        @driver = Driver.find_or_create_by(name: params[:tow][:driver])
        @dispatcher = Dispatcher.find_or_create_by(name: params[:tow][:dispatcher])
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."name" = ? LIMIT ?  [["name", "Heath"], ["LIMIT", 1]]
INSERT INTO "dispatchers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Jess"], ["created_at", "2020-07-20 06:06:21.982150"], ["updated_at", "2020-07-20 06:06:21.982150"]]
SELECT "dispatchers".* FROM "dispatchers" WHERE "dispatchers"."name" = ? LIMIT ?  [["name", "Jess"], ["LIMIT", 1]]