tow-mater-backend/app/controllers/tows_controller.rb

    def create
        driver = Driver.find_or_create_by(name: params[:tow][:driver])
        dispatcher = Dispatcher.find_or_create_by(name: params[:tow][:dispatcher])
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."name" = ? LIMIT ?  [["name", ""], ["LIMIT", 1]]
SELECT "dispatchers".* FROM "dispatchers" WHERE "dispatchers"."name" = ? LIMIT ?  [["name", ""], ["LIMIT", 1]]